# Python script to read the data in excel and adding it to MySQL database

In [25]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [26]:
pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\programdata\anaconda3\lib\site-packages (0.9.3)
Note: you may need to restart the kernel to use updated packages.

In [27]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (1.3.5)
Note: you may need to restart the kernel to use updated packages.

In [28]:
import sqlalchemy

In [52]:
#creating sqlalchemy engine by using create engine method
engine=sqlalchemy.create_engine('mysql+pymysql://root:sachin12031997@12@localhost:3306/products')
engine

Engine(mysql+pymysql://root:***@localhost:3306/products)

In [53]:
#reading the csv file
df=pd.read_csv('C:/Users/Sachin/Downloads/beginner_assignment01 - product_listing.csv')
df.head()

,Product Name,Model Name,Product Serial No,Group Associated,product MRP (rs.)
0,Demo Product 1,Product Model 1,98765987659801,Group 1,1001
1,Demo Product 1,Product Model 1,98765987659802,Group 2,1002
2,Demo Product 1,Product Model 1,98765987659803,Group 3,1003
3,Demo Product 1,Product Model 1,98765987659804,Group 4,1004
4,Demo Product 1,Product Model 1,98765987659805,Group 5,1005

In [54]:
#renaming the column for easy query
df.rename(columns={'Product Name':'product_name',
                   'Model Name':'model_name',
                   'Product Serial No':'product_serial_no',
                   'Group Associated':'group_associated',
                   'product MRP (rs.)':'product_mrp'},inplace=True)

In [55]:
#adding the data to sql database
df.to_sql(name='product_listing',con=engine,index=False,if_exists='append')

In [ ]:
#similar action performed for the group listing data provided

In [56]:
df1=pd.read_csv('C:/Users/Sachin/Downloads/beginner_assignment01 - group_listing.csv')
df1.head()

  group name group description isActive
0    Group 1    Group Number 1      yes
1    Group 2    Group Number 2      yes
2    Group 3    Group Number 3      yes
3    Group 4    Group Number 4      yes
4    Group 5    Group Number 5      yes

In [57]:
df1.rename(columns={'group name':'group_name',
                   'group description':'group_description',
                   'isActive':'is_active',},inplace=True)

In [58]:
df1.to_sql(name='group_listing',con=engine,index=False,if_exists='append')